IDENTIFICATION DIVISION.
PROGRAM-ID. CELTOF.
DATA DIVISION.
  WORKING STORAGE SECTION.
    01 C-TEMP PIC 9(3)V99.
    01 F-TEMP PIC 9(2)V99.
PROCEDURE DIVISION.
  DISPLAY "ENTER A TEMPERATURE IN CELSIUS:".
  ACCEPT  C-TEMP.
  COMPUTE F-TEMP=(C-TEMP * 9/5)+32.
  DISPLAY "TEMPERATURE IN FAHRENHEIT:".
  STOP RUN.

  
