IDENTIFICATION DIVISION.
PROGRAM-ID. CELTOF.
DATA DIVISION.
  WORKING STORAGE SECTION.
    01 C-TEMP PIC 9(2)V99.
    01 F-TEMP PIC 9(2)V99.
PROCEDURE DIVISION.
  
