IDENTIFICATION DIVISION.
PROGRAM-ID. FACT.
DATA DIVISION.
 WORKING STORAGE SECTION.
  01 NUM PIC 9(2).
  01 FACT PIC 9(18) VALUE 1.
  01 I PIC 9(2) VALUE 1.
  01 RES PIC Z(10).
PROCEDURE DIVISION.
   DISPLAY "ENTER THE NUMBER:".
   ACCEPT NUM.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
         MULTIPLY FACT BY I GIVING FACT
   END-PERFORM.
   MOVE FACT TO RES.
   DISPLAY "FACTORIAL IS:" RES.
   STOP RUN.
