IDENTIFICATION DIVISION.
  PROGRAM-ID. PRINTING NUM.
DATA DIVISION. 
  WORKING STORAGE SECTION.
    01 I PIC 9(2) VALUE 1.
PROCEDURE DIVISION.
    PERFORM 100 TIMES 
        DISPLAY I
        ADD 1 TO I
    END-PREFORM.
    STOP RUN.
