IDENTIFICATION DIVISION.
  PROGRAM-ID. SUMNUM.
DATA DIVISION.
  01 A.
    03 N PIC 9(1) OCCURS 20 TIMES.
  01 I PIC 9(2).
  01 TOTAL PIC 9(3).
PROCEDURE DIVISION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
          DISPLAY "ENTER THE NUMBERS:"
          ACCEPT N(I)
          ADD N(I) TO TOTAL
    END-PERFORM.
    DISPLAY "SUM OF NUMBERS:"TOTAL.
    STOP RUN.
  
